In [43]:
import sqlite3
conn = sqlite3.connect('practica-sql.db')
c = conn.cursor()

In [90]:
def q (sent):
    c.execute(sent)
    names = list(map(lambda x: x[0], c.description))
    print(names)
    for row in c.execute(sent):
        print(row)

Ver tablas de la base

In [45]:
q('select name from sqlite_master where type="table";')

('departamentos',)
('empleados',)
('ordenes',)
('productos',)
('proveedores',)
('renglones',)

Ver estructura de la tabla ""

In [46]:
c.execute('PRAGMA table_info("empleados")').fetchall()

[(0, 'nombre', 'varchar(255)', 0, "''", 0),
 (1, 'calle', 'varchar(255)', 0, "''", 0),
 (2, 'numero', 'varchar(255)', 0, "''", 0),
 (3, 'piso', 'varchar(255)', 0, "''", 0),
 (4, 'depto', 'varchar(255)', 0, "''", 0),
 (5, 'sexo', 'varchar(255)', 0, "''", 0),
 (6, 'tipo_documento', 'varchar(255)', 0, "''", 0),
 (7, 'estado_civil', 'varchar(255)', 0, "''", 0),
 (8, 'codigo', 'decimal(28,0)', 1, "'0'", 1),
 (9, 'nro_documento', 'decimal(28,0)', 1, "'0'", 0),
 (10, 'salario', 'decimal(28,0)', 1, "'0'", 0),
 (11, 'comision', 'decimal(28,0)', 0, "'0'", 0),
 (12, 'codigo_dep', 'decimal(28,0)', 0, "'0'", 0)]

In [47]:
c.execute('PRAGMA table_info("proveedores")').fetchall()

[(0, 'nombre', 'varchar(255)', 0, "''", 0),
 (1, 'direccion', 'varchar(255)', 0, "''", 0),
 (2, 'ciudad', 'varchar(255)', 0, "''", 0),
 (3, 'telefono', 'varchar(255)', 0, "''", 0),
 (4, 'tipo_credito', 'varchar(255)', 0, "''", 0),
 (5, 'codigo', 'decimal(28,0)', 1, "'0'", 1)]

## Ejercicios

### 1 SENTENCIA SELECT

a) Mostrar el contenido de la tabla empleados.

In [91]:
q('select * from empleados;')

['nombre', 'calle', 'numero', 'piso', 'depto', 'sexo', 'tipo_documento', 'estado_civil', 'codigo', 'nro_documento', 'salario', 'comision', 'codigo_dep']
('Perez Carlos Alberto', 'Parana', '555', None, None, 'M', 'DNI', 'SOLTERO', 1, 23194853, 20600, 1000, 1)
('Jaime Daniel', 'Pasco', '1685', '5', 'A', 'M', 'DNI', 'CASADO', 2, 15354702, 15500, None, 3)
('Miranda Adriana', 'Jujuy', '204', '3', 'H', 'F', 'CI', 'CASADO', 3, 7862169, 17750, 1500, 2)
('Cucagna Karina', 'Forest', '856', 'PB', 'A', 'F', 'DNI', 'SOLTERO', 4, 24578699, 15500, None, 5)
('Soria Laura', 'Av. Corrientes', '5489', '14', 'C', 'F', 'DNI', 'CASADO', 5, 25471025, 22000, None, 4)
('Scorza Miguel', 'Holanda', '245', None, None, 'M', 'DNI', 'CASADO', 6, 8234977, 15500, None, 1)
('Deluca Luis', 'Lima', '399', '1', 'D', 'M', 'DNI', 'CASADO', 7, 24614722, 18800, 3500, 2)
('Cosio Alejandro', 'Cordoba', '2185', '5', 'W', 'M', 'DNI', 'CASADO', 8, 10547932, 19900, 2500, 3)
('Fernandez Maria Cristina', 'Cordoba', '4885', '1', 'A', 'F', 'DNI', 'SOLTERO', 9, 17547222, 13300, None, 3)
('Fernandez Sofia', 'Alambes', '344', None, None, 'F', 'DNI', 'CASADO', 10, 11847562, 13300, 2500, 3)
('Rodriguez Carlos Alberto', 'Guido', '1234', '5', None, 'M', 'DNI', 'CASADO', 11, 12987677, 29900, 4500, 5)
('Marto Lima Fracesca', 'Av. del Corral', '2334', None, None, 'F', 'CI', 'DIVORCIADO', 12, 10547932, 29900, 5500, 5)
('Coronda Ana Laura', 'Rawson', '123', None, None, 'F', 'DNI', 'SOLTERO', 13, 24459333, 9900, None, 6)
('Casaso Martin', 'Julian Alvarez', '2223', '10', 'H', 'M', 'CI', 'VIUDO', 14, 10897878, 14400, 1000, 6)
('Martinez Javier Alberto', 'Del Solar', '32', None, None, 'M', 'CI', 'SOLTERO', 15, 30495887, 7700, None, 6)
('Puan Sandra Maria', 'Pasaje del Pilar', '56', '12', None, 'F', 'DNI', 'CASADO', 16, 18123444, 11100, 150, 2)
('Valle Alerce Maria', 'Libertador', '3444', '23', None, 'F', 'DNI', 'CASADO', 17, 12555532, 39900, 550, 6)
('Asalez Marcos', 'Sarandi', '455', '6', 'J', 'M', 'DNI', 'SOLTERO', 18, 19542382, 7700, None, 3)

b) Mostrar el nombre y teléfono de los proveedores.

In [50]:
q('select p.nombre, p.telefono from proveedores p;')

('ATALAYA S.R.L.', '4777-3456')
('ROCAMORA E HIJOS', '4752-7620')
('LA PERUANA', '4432-0485')
('RUTA S.A.', '4285-0932')
('COMODINES', '4436-9332')
('LA SEXTA', '02336-9332')
('AGUSTINEZ Y HERMANOS S.A.', '4554-9344')
('PEREZ, PEREZ, Y RODRIGUEZ', '4999-1313')
('AGUSTIN FERNANDEZ Y ASOCIADOS', '023-36-7727')
('COMODO S.R.L.', '0996-1122')
('PARIS', '021-26-1220')
('MIS LAPICES', '1212-3332')

### 2 RESTRICCIÓN Y ORDENAMIENTO DE LAS BÚSQUEDAS

a) Mostrar el nombre, salario y estado civil de los empleados del departamento 5.

In [51]:
q('select e.nombre, e.salario, e.estado_civil from empleados e where e.codigo_dep = 5')

('Cucagna Karina', 15500, 'SOLTERO')
('Rodriguez Carlos Alberto', 29900, 'CASADO')
('Marto Lima Fracesca', 29900, 'DIVORCIADO')

b) Mostrar el nombre, salario y estado civil de los empleados del departamento 5 que estén casados.

In [53]:
q('select e.nombre, e.salario, e.estado_civil from empleados e where e.codigo_dep = 5 AND e.estado_civil = "CASADO";')

('Rodriguez Carlos Alberto', 29900, 'CASADO')

c) Ordenar el resultado obtenido por nombre del empleado.

In [54]:
q('SELECT e.nombre, e.salario, e.estado_civil FROM empleados e WHERE e.codigo_dep = 5 AND e.estado_civil = "CASADO" ORDER BY e.nombre;')

('Rodriguez Carlos Alberto', 29900, 'CASADO')

d) Listar el nombre y la suma del salario y comisión de los empleados que ganen más de 15500 pesos de los departamentos 2 y 5.

In [72]:
q('select e.nombre, (e.salario+e.comision) AS sumaSalarioComision from empleados e where e.salario > 15500 AND (e.codigo_dep = 2 OR e.codigo_dep = 5);')

('Perez Carlos Alberto', 21600)
('Miranda Adriana', 19250)
('Soria Laura', None)
('Deluca Luis', 22300)
('Cosio Alejandro', 22400)
('Rodriguez Carlos Alberto', 34400)
('Marto Lima Fracesca', 35400)
('Valle Alerce Maria', 40450)

e) Listar los empleados con sus salarios y comisiones y calcular el salario anual considerando que el aguinaldo equivale a un mes de sueldo sin contar la comisión.

In [59]:
q('SELECT e.nombre, e.salario, e.comision, (e.salario*12) AS salarioAnual FROM empleados e')

('Perez Carlos Alberto', 20600, 1000, 247200)
('Jaime Daniel', 15500, None, 186000)
('Miranda Adriana', 17750, 1500, 213000)
('Cucagna Karina', 15500, None, 186000)
('Soria Laura', 22000, None, 264000)
('Scorza Miguel', 15500, None, 186000)
('Deluca Luis', 18800, 3500, 225600)
('Cosio Alejandro', 19900, 2500, 238800)
('Fernandez Maria Cristina', 13300, None, 159600)
('Fernandez Sofia', 13300, 2500, 159600)
('Rodriguez Carlos Alberto', 29900, 4500, 358800)
('Marto Lima Fracesca', 29900, 5500, 358800)
('Coronda Ana Laura', 9900, None, 118800)
('Casaso Martin', 14400, 1000, 172800)
('Martinez Javier Alberto', 7700, None, 92400)
('Puan Sandra Maria', 11100, 150, 133200)
('Valle Alerce Maria', 39900, 550, 478800)
('Asalez Marcos', 7700, None, 92400)

f) Mostrar los renglones de las órdenes calculando el total de cada renglón.

In [67]:
q('SELECT r.nro_renglon, (r.precio*r.cantidad) AS total FROM renglones r;')

(1, 100)
(2, 820)
(3, 4100)
(1, 2000)
(2, 1464)
(3, 1200)
(4, 648)
(5, 360)
(1, 5680)
(2, 4600)
(3, 5400)
(4, 6710)
(5, 14400)
(6, 4080)
(1, 5000)
(2, 500)
(3, 1000)
(4, 3000)
(1, 310)
(2, 300)
(1, 3720)
(2, 2760)
(3, 760)
(4, 900)
(5, 3240)
(6, 2790)
(7, 1100)
(1, 1100)
(2, 2530)
(3, 720)
(4, 410)
(5, 1734)
(1, 2074)
(2, 2074)
(3, 2880)
(4, 2750)
(1, 2074)
(2, 120)
(3, 144)
(4, 4914)
(5, 60)
(6, 660)
(7, 240)
(8, 240)
(1, 1440)
(2, 250)
(3, 132)
(4, 105)
(5, 9240)
(1, 2160)
(2, 1680)
(3, 1200)
(1, 360)
(2, 300)
(3, 100)
(4, 144)
(5, 744)
(6, 756)
(7, 396)
(8, 400)
(1, 744)
(2, 105)
(3, 200)
(4, 1694)
(1, 2050)
(2, 120)
(3, 612)
(4, 1150)
(5, 100)
(6, 100)
(7, 1224)
(8, 400)
(9, 600)
(1, 820)
(2, 500)
(1, 4100)
(2, 420)
(3, 300)
(4, 50)
(5, 2745)
(1, 50)
(2, 110)
(3, 240)
(4, 600)
(5, 132)
(6, 500)
(1, 600)
(2, 252)
(3, 240)

In [76]:
#Ver encabezado de tabla renglones
c.execute('PRAGMA table_info("renglones")').fetchall()

[(0, 'nro_orden', 'decimal(28,0)', 1, "'0'", 1),
 (1, 'nro_renglon', 'decimal(28,0)', 1, "'0'", 2),
 (2, 'codigo_pro', 'decimal(28,0)', 1, "'0'", 0),
 (3, 'precio', 'decimal(28,0)', 1, "'0'", 0),
 (4, 'cantidad', 'decimal(28,0)', 1, "'0'", 0)]

In [75]:
#Ver todo renglones
q('SELECT * FROM renglones')

(1, 1, 1000223, 10, 10)
(1, 2, 7078080, 41, 20)
(1, 3, 9002006, 41, 100)
(2, 1, 1100334, 40, 50)
(2, 2, 6007023, 61, 24)
(2, 3, 6007045, 120, 10)
(2, 4, 1034219, 54, 12)
(2, 5, 1034311, 30, 12)
(3, 1, 1000225, 71, 80)
(3, 2, 1100333, 230, 20)
(3, 3, 4210002, 120, 45)
(3, 4, 4210004, 61, 110)
(3, 5, 7078092, 120, 120)
(3, 6, 9002003, 340, 12)
(4, 1, 4555102, 50, 100)
(4, 2, 1034219, 5, 100)
(4, 3, 1034310, 10, 100)
(4, 4, 6008070, 30, 100)
(5, 1, 7078092, 31, 10)
(5, 2, 4210002, 10, 30)
(6, 1, 7078090, 31, 120)
(6, 2, 7078092, 230, 12)
(6, 3, 1002106, 380, 2)
(6, 4, 1000225, 30, 30)
(6, 5, 1000223, 81, 40)
(6, 6, 1002024, 31, 90)
(6, 7, 1100333, 10, 110)
(7, 1, 1100333, 10, 110)
(7, 2, 1034108, 230, 11)
(7, 3, 6007045, 30, 24)
(7, 4, 6007055, 41, 10)
(7, 5, 8080803, 51, 34)
(8, 1, 8080803, 61, 34)
(8, 2, 7078090, 61, 34)
(8, 3, 6008070, 120, 24)
(8, 4, 4555108, 50, 55)
(9, 1, 8080803, 61, 34)
(9, 2, 1034311, 10, 12)
(9, 3, 6007055, 6, 24)
(9, 4, 6007066, 91, 54)
(9, 5, 1034108, 20, 3)
(9, 6, 1000223, 10, 66)
(9, 7, 1000225, 60, 4)
(9, 8, 4555104, 60, 4)
(10, 1, 8080803, 60, 24)
(10, 2, 6007066, 50, 5)
(10, 3, 4210002, 11, 12)
(10, 4, 1002025, 21, 5)
(10, 5, 1002106, 120, 77)
(11, 1, 8080803, 60, 36)
(11, 2, 6008070, 70, 24)
(11, 3, 4555102, 50, 24)
(12, 1, 7078092, 60, 6)
(12, 2, 4452025, 30, 10)
(12, 3, 4210002, 10, 10)
(12, 4, 4210003, 6, 24)
(12, 5, 6007045, 31, 24)
(12, 6, 6007066, 21, 36)
(12, 7, 6008070, 11, 36)
(12, 8, 8080803, 40, 10)
(13, 1, 1100333, 31, 24)
(13, 2, 1000223, 21, 5)
(13, 3, 4555108, 40, 5)
(13, 4, 6007045, 121, 14)
(14, 1, 4555108, 41, 50)
(14, 2, 9002004, 10, 12)
(14, 3, 4555104, 51, 12)
(14, 4, 9002006, 230, 5)
(14, 5, 6008070, 10, 10)
(14, 6, 6007023, 10, 10)
(14, 7, 1002025, 51, 24)
(14, 8, 1000224, 20, 20)
(14, 9, 4210002, 6, 100)
(15, 1, 4555108, 41, 20)
(15, 2, 6007055, 10, 50)
(16, 1, 6007023, 41, 100)
(16, 2, 4555108, 21, 20)
(16, 3, 6008058, 30, 10)
(16, 4, 7078080, 10, 5)
(16, 5, 8080803, 61, 45)
(17, 1, 7078080, 10, 5)
(17, 2, 6008058, 11, 10)
(17, 3, 6007055, 20, 12)
(17, 4, 4452024, 50, 12)
(17, 5, 1002106, 11, 12)
(17, 6, 9002003, 100, 5)
(18, 1, 4452024, 50, 12)
(18, 2, 1100334, 21, 12)
(18, 3, 7078080, 20, 12)

g) Mostrar los precios de los productos de las órdenes 2,3, 5, 10, 17 y 18 incrementados en un 10% y redondeados a 2 decimales.

In [ ]:
q('')

h) Hallar los nombres de los empleados con longitud mayor a 15.

### 3 USO DE FUNCIONES DE GRUPO

a) Hallar el valor máximo, valor mínimo y promedio de sueldos de los empleados.

b) Mostrar la cantidad de empleados por departamento.

c) Hallar el promedio de sueldos por departamento.

In [74]:
q('SELECT e.codigo_dep, ROUND(AVG(e.salario),2) AS avgSalario FROM empleados e GROUP BY codigo_dep;')

(1, 18050.0)
(2, 15883.33)
(3, 13940.0)
(4, 22000.0)
(5, 25100.0)
(6, 17975.0)

d) Detectar los productos que se han vendido más de una vez.

In [93]:
q('SELECT r.codigo_pro, COUNT(r.codigo_pro) AS Cantidad FROM renglones r GROUP BY r.codigo_pro HAVING count(*)>1;')

['codigo_pro', 'Cantidad']
(1000223, 4)
(1000225, 3)
(1002025, 2)
(1002106, 3)
(1034108, 2)
(1034219, 2)
(1034311, 2)
(1100333, 4)
(1100334, 2)
(4210002, 5)
(4452024, 2)
(4555102, 2)
(4555104, 2)
(4555108, 5)
(6007023, 3)
(6007045, 4)
(6007055, 4)
(6007066, 3)
(6008058, 2)
(6008070, 5)
(7078080, 4)
(7078090, 2)
(7078092, 4)
(8080803, 7)
(9002003, 2)
(9002006, 2)

e) Calcular la cantidad de hombres y mujeres que trabajan en cada
departamento.

In [101]:
q('SELECT e.codigo_dep, e.sexo, COUNT(*) AS cantidad FROM empleados e GROUP BY e.codigo_dep, e.sexo')

['codigo_dep', 'sexo', 'cantidad']
(1, 'M', 2)
(2, 'F', 2)
(2, 'M', 1)
(3, 'F', 2)
(3, 'M', 3)
(4, 'F', 1)
(5, 'F', 2)
(5, 'M', 1)
(6, 'F', 2)
(6, 'M', 2)

f) Mostrar la cantidad de empleados por departamento, para aquellos departamentos con más de 3 empleados.

In [104]:
q('SELECT e.codigo_dep, count(*) AS total FROM empleados e GROUP BY e.codigo_dep HAVING count(*) > 3;')

['codigo_dep', 'total']
(3, 5)
(6, 4)

### 4 COMBINACIÓN DE TABLAS Y CONSULTAS ANIDADAS

a) Listar los códigos, nombres de proveedores, y cantidad total comprada.

b) Listar para cada proveedor el nombre, número de orden, productos y descripción del mismo.

c) Listar los nombres de los productos correspondientes a órdenes cuyo tipo de pago es CONTADO.

d) Listar los nombres de los diferentes productos que han sido ordenados.

e) Detectar cuáles productos no han sido ordenados.

f) Recuperar el nombre y el departamento de los empleados de mayor sueldo y de los de menor sueldo indicando en una columna la condición de mayor o de menor según corresponda.

g) Obtener el departamento de los empleados que cobran, al menos, el doble que el sueldo promedio de los empleados.

h) Listar el nombre, puesto, sexo y salario de todos los empleados que tienen un salario superior al salario más bajo. Ordenar la recuperación por salario en forma ascendente.

i) Listar las personas que ganen más de 950 pesos que el miembro del personal de sueldo más alto de sexo masculino. Indicar si son hombres o mujeres y su salario.

### 5. CREACION DE TABLAS Y MODIFICACIÓN DE DATOS